<!--
title: Обеспечьте динамическую маршрутизацию
description: Настройка OSPF на Eltex vESR
published: true
date: 2025-03-07T05:10:02.473Z
tags: 
editor: ckeditor
dateCreated: 2025-01-18T11:16:45.701Z
-->

<h1><span class="text-small"><strong>Для обеспечения динамической маршрутизации используйте link state протокол на ваше усмотрение</strong></span></h1>
<p>Мы будем использовать OSPF. Но имейте ввиду, настройка OSPF на маршрутизаторах Eltex, значительно отличается от аналогичного процесса на Cisco.</p>
<p>Особенности Eltex:</p>
<ol>
  <li>Вместо корневой зоны 0 используется 0.0.0.0</li>
  <li>Network задается не по принципу шаблона как в cisco, т.е. нельзя указать общую сеть 192.168.10.0/24, нужно указывать каждую подсеть 192.168.10.0/26, 192.168.10.64/28 и т.д.</li>
  <li>Нужно вручную активировать OSPF на интерфейсах и задавать номер процесса OSPF</li>
</ol>
<p>HQ-RTR:</p>
<pre><code class="language-plaintext"># Создаем ключ для парольной аутентификации ospf между маршрутизаторами
hq-rtr(config)# key-chain auth_ospf
hq-rtr(config-keychain)# key 1
hq-rtr(config-keychain-key)# key-string ascii-text cisco_forever     //Указываем пароль cisco_forever
br-rtr(config-keychain-key)# exit
br-rtr(config-keychain)# exit

hq-rtr(config)# router ospf 1
hq-rtr(config-ospf)# router-id 100.10.10.1     //ip нашего gre туннеля
hq-rtr(config-ospf)# area 0.0.0.0
hq-rtr(config-ospf-area)# network 192.168.10.0/26
hq-rtr(config-ospf-area)# network 192.168.10.64/28
hq-rtr(config-ospf-area)# network 192.168.10.80/29
hq-rtr(config-ospf-area)# enable
hq-rtr(config-ospf-area)# exit
hq-rtr(config-ospf)# enable
hq-rtr(config-ospf)# exit

hq-rtr(config)# tunnel gre 1
hq-rtr(config-if-gi)# ip ospf instance 1    //номер процесса ospf
hq-rtr(config-if-gi)# ip ospf
hq-rtr(config-if-gi)# ip ospf authentication key-chain auth_ospf
hq-rtr(config-if-gi)# ip ospf authentication algorithm md5
hq-rtr(config-if-gi)# end

hq-rtr# commit
hq-rtr# confirm</code></pre>
<p>BR-RTR:</p>
<pre><code class="language-plaintext">br-rtr(config)# key-chain auth_ospf
br-rtr(config-keychain)# key 1
br-rtr(config-keychain-key)# key-string ascii-text cisco_forever
br-rtr(config-keychain-key)# exit
br-rtr(config-keychain)# exit

br-rtr(config)# router ospf 1
br-rtr(config-ospf)# router-id 100.10.10.2
br-rtr(config-ospf)# area 0.0.0.0
br-rtr(config-ospf-area)# network 192.168.20.0/27
br-rtr(config-ospf-area)# enable
br-rtr(config-ospf-area)# exit
br-rtr(config-ospf)# enable
br-rtr(config-ospf)# exit

br-rtr(config)# tunnel gre 1
br-rtr(config-if-gi)# ip ospf instance 1
br-rtr(config-if-gi)# ip ospf
br-rtr(config-if-gi)# ip ospf authentication key-chain auth_ospf
br-rtr(config-if-gi)# ip ospf authentication algorithm md5
br-rtr(config-if-gi)# end

br-rtr# commit
br-rtr# confirm</code></pre>
<p>Проверьте установилось ли "соседство" между маршрутизаторами:</p>
<pre><code class="language-plaintext">vesr# show ip ospf neighbors</code></pre>
<p>Проверьте появились ли в таблице маршрутизации ospf маршруты:</p>
<pre><code class="language-plaintext">vesr# show ip route</code></pre>
<p>Если на прошлом шаге вы добавляли статические маршруты, то после настройки динамики их нужно удалить:</p>
<pre><code class="language-plaintext"># На HQ-RTR
hq-rtr(config)# no ip route 192.168.20.0/24

# На BR-RTR
br-rtr(config)# no ip route 192.168.10.0/24</code></pre>
